emacs/tips.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Useful Emacs Tips &amp; Tricks</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Useful Emacs Tips &amp; Tricks</h1>
<p>
This page contains an unordered (well ordered by time) collection of
useful tips &amp; tricks in Emacs, both for normal Emacs use but also
for Common Lisp Developers. Hope you find it useful!
</p>

<div id="outline-container-org6c2da51" class="outline-2">
<h2 id="org6c2da51">Local CLHS Access in Emacs (31 July 2021)</h2>
<div class="outline-text-2" id="text-org6c2da51">
<p>
Source: <a href="http://snowsyn.net/2020/01/01/local-clhs-access-in-emacs/">Nicolas Martyanoff Blog</a>
</p>

<p>
To look up the symbol at point, use <code>slime-documentation-lookup</code> 
or <code>C-c C-d h</code>. To use a local copy of the HyperSpec, add something
like the following to your <code>.emacs</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(setq common-lisp-hyperspec-root
      (concat <span style="color: #8b2252;">"file://"</span> (expand-file-name <span style="color: #8b2252;">"~/folder-path/HyperSpec/"</span>)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Then one of the two following options to set eww as the browser</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">for opening CLHS links:</span>

(setq browse-url-browser-function 'eww-browse-url)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">or to use the default browser for other links:</span>

(setq browse-url-browser-function
      '((<span style="color: #8b2252;">"hyperspec"</span> . eww-browse-url)
        (<span style="color: #8b2252;">"."</span> . browse-url-default-browser)))

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 31 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
